ЦентраАдминистрированияСервер/src/Catalogs/ВнешниеДополнительныеОтчетыИОбработки/ВнешниеДополнительныеОтчетыИОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнешниеДополнительныеОтчетыИОбработки</name>
  <attributes>
    <name>БезопасныйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидыДополнительныхОтчетовИОбработок</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>260</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеОбработки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Публикация</name>
    <type>
      <types>EnumRef.ВидыДополнительныхОтчетовИОбработок</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокИнформационныхБаз</name>
    <attributes>
      <name>ИнформационнаяБаза</name>
      <type>
        <types>CatalogRef.ИнформационныеБазы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВерсииОбработки</name>
  </tabularSections>
</mdclass:Catalog>

ЦентраАдминистрированияСервер/src/Catalogs/ВнешниеДополнительныеОтчетыИОбработки/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура СинхронизироватьОбработкиНаСервере(МассивБаз)
	
	Для каждого СтрокаБаза из МассивБаз цикл
		СтруктураПодключения = РаботаСПодключениямиCOM.ПолучитьСоединениеСИнформационнойБазой(СтрокаБаза);
		Если СтруктураПодключения.Connect <> Неопределено Тогда
			Connect = СтруктураПодключения.Connect;
			
			Запрос = Connect.NewObject("Запрос");
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ДополнительныеОтчетыИОбработки.Наименование,
				|	ДополнительныеОтчетыИОбработки.Вид,
				|	ДополнительныеОтчетыИОбработки.ИмяОбъекта,
				|	ДополнительныеОтчетыИОбработки.ИмяФайла,
				|	ДополнительныеОтчетыИОбработки.Комментарий,
				|	ДополнительныеОтчетыИОбработки.Публикация,
				|	ДополнительныеОтчетыИОбработки.БезопасныйРежим
				|ИЗ
				|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки";
				
				ВыборкаОбработокCOM = Запрос.Выполнить().Выбрать();
				Пока ВыборкаОбработокCOM.Следующий() цикл
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ ПЕРВЫЕ 1
					|	ВнешниеДополнительныеОтчетыИОбработки.Ссылка
					|ИЗ
					|	Справочник.ВнешниеДополнительныеОтчетыИОбработки КАК ВнешниеДополнительныеОтчетыИОбработки
					|ГДЕ
					|	ВнешниеДополнительныеОтчетыИОбработки.ИмяОбъекта = &ИмяОбъекта";
					
					Запрос.УстановитьПараметр("ИмяОбъекта", ВыборкаОбработокCOM.ИмяОбъекта);
					
					ВыборкаОбработокВТекущейБазе = Запрос.Выполнить().Выбрать();
					Если ВыборкаОбработокВТекущейБазе.Следующий() Тогда
						
						ОбъектОбработкиТекБазы = ВыборкаОбработокВТекущейБазе.Ссылка.ПолучитьОбъект();
						
					Иначе
						
						ОбъектОбработкиТекБазы = Справочники.ВнешниеДополнительныеОтчетыИОбработки.СоздатьЭлемент();
						
					КонецЕсли;
					
					//Ищем текбазу в списке баз обработки
					
					СтрокаИнформационнойБазы = ОбъектОбработкиТекБазы.СписокИнформационныхБаз.Найти(СтрокаБаза, "ИнформационнаяБаза");
					Если СтрокаИнформационнойБазы = Неопределено Тогда
						НоваяСтрокаИнформационнойБазы = ОбъектОбработкиТекБазы.СписокИнформационныхБаз.Добавить();					
						НоваяСтрокаИнформационнойБазы.ИнформационнаяБаза = СтрокаБаза;
					КонецЕсли;
					
					ОбъектОбработкиТекБазы.Записать();
					
				КонецЦикла
			Иначе
				Сообщить("Подключение к базе "+СтруктураПодключения.ИмяБазыВКластере + " не установлено");
			Конецесли;
		КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьОбработки(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
	ПоказатьВопрос(Оповещение, "Перед загрузкой данных будут удалены все текущие обработки" + Символы.ПС
							+"Продолжить выполнение операции?", Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура("ВыбратьБазы", Истина);
	ОткрытьФорму("Обработка.РабочееМестоАдминистратора.Форма.РабочееМестоАдминистратора",ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	СинхронизироватьОбработкиНаСервере(ВыбранноеЗначение);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры
